Revit 2027 API
FilteredElementCollector(Document) Constructor
 Constructs a new FilteredElementCollector that will search and filter the set of elements in a document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FilteredElementCollector(
	Document document
)
Public Sub New (
	document As Document
)
public:
FilteredElementCollector(
	Document^ document
)
new :
        document : Document -> FilteredElementCollector
Parameters
document Document
 The document.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FilteredElementCollector Class
FilteredElementCollector Overload
Autodesk.Revit.DB Namespace